{"backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["activation_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1, 48, 48], "sparse": false}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_1", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.2}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_2", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_3", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.2}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_4", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_5", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.2}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_6", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": 1}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_7", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.2}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_8", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "config": {"name": "concatenate_2", "trainable": true, "axis": 1}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_9", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "dropout_5", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.2}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_10", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "conv2d_11", "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "trainable": true, "bias_regularizer": null, "filters": 2, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [2, 2304], "trainable": true}}, {"name": "permute_1", "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "permute_1", "dims": [2, 1], "trainable": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.1.6", "class_name": "Model"}